/***********************************************************************/
/*                                                                     */
/*  FILE        : util.h                                               */
/*  DESCRIPTION : corrected original util                              */
/*                                                                     */
/***********************************************************************/

#ifndef UTIL_H
#define UTIL_H
#include "stdbool.h"

//------------------------------------------------
//  マクロ定義
//------------------------------------------------

//------------------------------------------------
//  グローバル変数宣言
//------------------------------------------------

//! コンペアマッチにより一秒ごとにインクリメントされるタイマーの変数
extern volatile long secondTimer;

//------------------------------------------------
//  プロトタイプ宣言(Prototype declaration)
//------------------------------------------------

void wait(float sec);

int count16bitVal(int anyInt);

#endif UTIL_H
