/***********************************************************************/
/*                                                                     */
/*  FILE        : util.h                                               */
/*  DESCRIPTION : corrected original util                              */
/*                                                                     */
/***********************************************************************/

#ifndef UTIL_H
#define UTIL_H
#include "stdbool.h"

//------------------------------------------------
//  マクロ定義
//------------------------------------------------

//------------------------------------------------
//  型定義(Type definition)
//------------------------------------------------

/**
 * @typedef Enum
 * 閾値以上であるかの状態定義
 */
typedef enum {
  no = 0,
  yes = 1,
} t_threshold;

//------------------------------------------------
//  グローバル変数宣言
//------------------------------------------------

extern volatile long secondTimer;

//------------------------------------------------
//  プロトタイプ宣言(Prototype declaration)
//------------------------------------------------

void wait(float sec);

int count16bitVal(int anyInt);

#endif UTIL_H
